# GS_EdSh_ConstructLayout

## Description
Creates a dialog layout for editing a shader's parameter values.

```pascal
PROCEDURE GS_EdSh_ConstructLayout(
				shaderNameCStr     : LONGINT;
				paramsPtr          : LONGINT;
				VAR libraryDataPtr : LONGINT);
```

```python
def vs.GS_EdSh_ConstructLayout(shaderNameCStr, paramsPtr):
    return libraryDataPtr
```

## Parameters
|Name|Type|Description|
|---|---|---|
|shaderNameCStr|LONGINT|   |
|paramsPtr|LONGINT|   |
|libraryDataPtr|LONGINT|   |

## Version
Availability: from Vectorworks 2014

## Category
* Textures